import os  # noqa: INP001

import aiofiles
from dotenv import load_dotenv
from telegram import InlineKeyboardButton, InlineKeyboardMarkup, Update, WebAppInfo
from telegram.ext import (
    ApplicationBuilder,
    CommandHandler,
    ContextTypes,
)

load_dotenv("../.env")

HELLO_IMG_PATH = "valentine_day/static/valentine_day/main.png"
API_KEY = os.environ["VALENTINE_BOT_API_KEY"]


async def start(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    _ = context
    """Обработчик команды /start."""
    if update.message is None:
        return
    # URL вашего Mini App (замените на реальный)
    web_app_url: str = "https://atl-asana.vim-store.ru/valentine-day/"
    welcome_text_1: str = (
        "У тебя тоже что-то внезапно закололо в области груди сегодня? Отмена паники! "
        "Это все шалости Святого Валентина, ведь сегодня он традиционно расчехлил "
        "свой колчан и пронзил твое сердечко!💘\n\n"
        "Запись к кардиологу рекомендуем не отменять, чекап — тоже важно\n\n"
        "Джоэл считал, что 14 февраля — это праздник, который придумали компании, "
        "производящие поздравительные открытки, чтобы заставить людей чувствовать себя паршиво.\n\n"
        "Мы же с ним не согласны категорически, и подготовили для тебя самые лучшие открытки "
        "для твоего друллеги, а ещё — этот бот, который поможет тебе признаться в твоей "
        "любви совершенно анонимно, без подписок, и смс 🥹\n\n"
        "🥰 Анонимно.\n"
        "☕️ Без объяснений.\n"
        "😊 Без «это я, если что», но можно и с ним!\n\n"
        "С нас — картинка, с тебя — текст, дальше всю магию любви берет на себя бот 💌\n\n"
        "Кто отправил? Один Валентин знает 🙏\n"
        "Кто получит? Вопросы тоже к тому парню с нимбом и стрелами!\n"
        "Что дальше? Покажет ✨любовь✨\n\n"
        "Заряжаем стрелу?"
    )
    # Текст сообщения
    welcome_text_2: str = (
        "<b>С праздником, коллега! 💌</b>\n\n"
        "В этом году мы решили наполнить наш офис теплом и добрыми словами. "
        "Специально к <b>14 февраля</b> мы запустили приложение, где можно "
        "отправить валентинку любому сотруднику!\n\n"
        "<b>Как это сделать:</b>\n"
        "1️⃣ Запустите приложение (кнопка Open или 'Отправить валентинку')\n"
        "2️⃣ Выбери получателя\n"
        "3️⃣ Подбери картинку и напиши текст\n"
        "4️⃣ Нажми «Сохранить»\n\n"
        "🤫 Все послания <b>анонимны</b>.\n"
        "⏳ Откроем почту <b>13 февраля в 14:00</b>."
    )

    # Создание кнопки Mini App
    keyboard = [[InlineKeyboardButton(text="💌 Отправить валентинку", web_app=WebAppInfo(url=web_app_url))]]
    reply_markup = InlineKeyboardMarkup(keyboard)
    with aiofiles.open(HELLO_IMG_PATH, "rb") as photo_file:
        await update.message.reply_photo(
            photo=photo_file,
            caption=welcome_text_1,
            parse_mode="HTML",
        )
        await update.message.reply_text(
            text=welcome_text_2,
            parse_mode="HTML",
            reply_markup=reply_markup,
        )


if __name__ == "__main__":
    app = ApplicationBuilder().token(API_KEY).build()

    app.add_handler(CommandHandler("start", start))
    print("Бот запущен...")
    app.run_polling()
